{
  "_name_or_path": "kpfbert",
  "adam_epsilon": 1e-08,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "batch_size": 8,
  "classifier_dropout": null,
  "device": "cuda",
  "epoch": 15,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "국회_정당",
    "1": "북한",
    "2": "선거",
    "3": "외교",
    "4": "청와대",
    "5": "행정_자치",
    "6": "골프",
    "7": "농구_배구",
    "8": "야구_메이저리그",
    "9": "야구_일본프로야구",
    "10": "올림픽_아시안게임",
    "11": "축구_월드컵",
    "12": "축구_한국프로축구",
    "13": "축구_해외축구",
    "14": "교육_시험",
    "15": "날씨",
    "16": "노동_복지",
    "17": "미디어",
    "18": "사건_사고",
    "19": "여성",
    "20": "의료_건강",
    "21": "장애인",
    "22": "환경",
    "23": "미술_건축",
    "24": "방송_연예",
    "25": "생활",
    "26": "요리_여행",
    "27": "음악",
    "28": "전시_공연",
    "29": "종교",
    "30": "출판",
    "31": "학술_문화재",
    "32": "러시아",
    "33": "미국_북미",
    "34": "아시아",
    "35": "유럽_EU",
    "36": "일본",
    "37": "중국",
    "38": "중남미",
    "39": "중동_아프리카",
    "40": "경제일반",
    "41": "국제경제",
    "42": "금융_재테크",
    "43": "무역",
    "44": "반도체",
    "45": "부동산",
    "46": "산업_기업",
    "47": "서비스_쇼핑",
    "48": "외환",
    "49": "유통",
    "50": "자동차",
    "51": "자원",
    "52": "증권_증시",
    "53": "취업_창업",
    "54": "IT_과학일반",
    "55": "과학",
    "56": "모바일",
    "57": "보안",
    "58": "인터넷_SNS",
    "59": "콘텐츠",
    "60": "강원",
    "61": "경기",
    "62": "경남",
    "63": "경북",
    "64": "광주",
    "65": "대구",
    "66": "대전",
    "67": "부산",
    "68": "울산",
    "69": "전남",
    "70": "전북",
    "71": "제주",
    "72": "지역일반",
    "73": "충남",
    "74": "충북"
  },
  "initializer_range": 0.02,
  "intermediate_hidden_size": 768,
  "intermediate_size": 3072,
  "label2id": {
    "국회_정당": 0,
    "북한": 1,
    "선거": 2,
    "외교": 3,
    "청와대": 4,
    "행정_자치": 5,
    "골프": 6,
    "농구_배구": 7,
    "야구_메이저리그": 8,
    "야구_일본프로야구": 9,
    "올림픽_아시안게임": 10,
    "축구_월드컵": 11,
    "축구_한국프로축구": 12,
    "축구_해외축구": 13,
    "교육_시험": 14,
    "날씨": 15,
    "노동_복지": 16,
    "미디어": 17,
    "사건_사고": 18,
    "여성": 19,
    "의료_건강": 20,
    "장애인": 21,
    "환경": 22,
    "미술_건축": 23,
    "방송_연예": 24,
    "생활": 25,
    "요리_여행": 26,
    "음악": 27,
    "전시_공연": 28,
    "종교": 29,
    "출판": 30,
    "학술_문화재": 31,
    "러시아": 32,
    "미국_북미": 33,
    "아시아": 34,
    "유럽_EU": 35,
    "일본": 36,
    "중국": 37,
    "중남미": 38,
    "중동_아프리카": 39,
    "경제일반": 40,
    "국제경제": 41,
    "금융_재테크": 42,
    "무역": 43,
    "반도체": 44,
    "부동산": 45,
    "산업_기업": 46,
    "서비스_쇼핑": 47,
    "외환": 48,
    "유통": 49,
    "자동차": 50,
    "자원": 51,
    "증권_증시": 52,
    "취업_창업": 53,
    "IT_과학일반": 54,
    "과학": 55,
    "모바일": 56,
    "보안": 57,
    "인터넷_SNS": 58,
    "콘텐츠": 59,
    "강원": 60,
    "경기": 61,
    "경남": 62,
    "경북": 63,
    "광주": 64,
    "대구": 65,
    "대전": 66,
    "부산": 67,
    "울산": 68,
    "전남": 69,
    "전북": 70,
    "제주": 71,
    "지역일반": 72,
    "충남": 73,
    "충북": 74
  },
  "layer_norm_eps": 1e-12,
  "learning_rate": 0.005,
  "max_grad_norm": 1.0,
  "max_position_embeddings": 512,
  "max_seq_len": 512,
  "model_name": "kpfbert",
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "seed": 1000,
  "test_data": "21_150tags_EntityLinking",
  "torch_dtype": "float32",
  "train_data": "21_150tags_EntityLinking",
  "transformers_version": "4.25.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 36440
}

